SQL Tutorial
SQL HOME
SQL Intro
SQL Syntax
SQL Select
SQL Select Distinct
SQL Where
SQL And, Or, Not
SQL Order By
SQL Insert Into
SQL Null Values
SQL Update
SQL Delete
SQL Select Top
SQL Min and Max
SQL Count, Avg, Sum
SQL Like
SQL Wildcards
SQL In
SQL Between
SQL Aliases
SQL Joins
SQL Inner Join
SQL Left Join
SQL Right Join
SQL Full Join
SQL Self Join
SQL Union
SQL Group By
SQL Having
SQL Exists
SQL Any, All
SQL Select Into
SQL Insert Into Select
SQL Case
SQL Null Functions
SQL Stored Procedures
SQL Comments
SQL Operators

SQL Database
SQL Create DB
SQL Drop DB
SQL Backup DB
SQL Create Table
SQL Drop Table
SQL Alter Table
SQL Constraints
SQL Not Null
SQL Unique
SQL Primary Key
SQL Foreign Key
SQL Check
SQL Default
SQL Index
SQL Auto Increment
SQL Dates
SQL Views
SQL Injection
SQL Hosting
SQL Data Types

###### importing the sqlite3

In [41]:
import sqlite3
import pandas as pd

###### connection with sqlite3 database

In [43]:
conn = sqlite3.connect("mini.db")

###### for writing the quaries, first we have to create the cursor

In [44]:
cur = conn.cursor()

#### For writing the quaries we will use the execute function
GETTING THE LIST OF TABLES NAMES FROM DATABASE

In [45]:
a = cur.execute("SELECT name FROM sqlite_master WHERE type='table'")

###### FOR FATCHING THE DATA FROM EXECUTED QUARIES WE WILL USE fetchall() or fetchone() or fetchmany()

In [46]:
a.fetchall()

[('ayushi',),
 ('sarang1',),
 ('ayushi1',),
 ('PAGAL1',),
 ('gunnu1',),
 ('gunnu2',)]

###### GETTING THE NO. OF TABLES PRESENT IN DATABASE

In [47]:
a = cur.execute("SELECT COUNT(name) FROM sqlite_master WHERE type='table'")
a.fetchone()[0]

6

###### CREATE TABLE

In [18]:
cur.execute("CREATE TABLE IF NOT EXISTS ayushi1(name varchar,age integer,gender varchar)")

###### Visualize the table into the pandas dataframe

In [19]:
# pd.read_sql("write quary here",connection obj)
pd.read_sql("select * from ayushi1",conn)

Empty DataFrame
Columns: [name, age, gender]
Index: []

###### Insert into table ,,,,*COMMIT IS NECESSARY*

In [129]:
cur.execute("insert into ayushi1 values('babu1',12,'M')")
cur.execute("insert into ayushi1 values('kalyani1',12,'M')")
cur.execute("insert into ayushi1 values('babu2',12,'M')")
cur.execute("insert into ayushi1 values('kalyani2',12,'M')")
conn.commit()

In [130]:
# look into table again
pd.read_sql("select * from ayushi1",conn)

       name  age gender
0     babu1   12      M
1  kalyani1   12      M
2     babu2   12      M
3  kalyani2   12      M

###### UPDATE

In [132]:
cur.execute("update ayushi1 set age = 22,gender = 'F' where name = 'kalyani1'")

###### SELECT

In [133]:
cur.execute("select * from ayushi1")
rows = cur.fetchall()
for row in rows:
    print(row)

('babu1', 12, 'M')
('kalyani1', 22, 'F')
('babu2', 12, 'M')
('kalyani2', 12, 'M')

###### Getting the column names of table

In [134]:
cur.execute("select * from ayushi1")
headers = []
for col in cur.description:
    headers.append(col[0])
headers

['name', 'age', 'gender']

###### Creating the the .csv file from db table

In [135]:
import csv
with open("myfile.csv",'w') as file:
    writer = csv.writer(file,delimiter=',',lineterminator="\n",quoting=csv.QUOTE_ALL)
    cur.execute("select * from ayushi1")
    rows = cur.fetchall()
    writer.writerow(headers)
    writer.writerows(rows)
    file.close()

In [136]:
pd.read_csv("myfile.csv")

       name  age gender
0     babu1   12      M
1  kalyani1   22      F
2     babu2   12      M
3  kalyani2   12      M

In [137]:
with open("myfile.csv",'r') as file:
    reader = csv.reader(file,delimiter=',',lineterminator="\t")
    for row in reader:
        print(row)
    file.close()

['name', 'age', 'gender']
['babu1', '12', 'M']
['kalyani1', '22', 'F']
['babu2', '12', 'M']
['kalyani2', '12', 'M']

###### DELETE

In [138]:
"""DELETE PARTICULAR ROW"""
cur.execute("DELETE FROM ayushi1 WHERE name = 'kalyani1'")

In [139]:
"""DELETE ALL ROWS"""
cur.execute("DELETE FROM ayushi1")

###### DROP TABLE

In [143]:
cur.execute("DROP TABLE ayushi1")

In [149]:
a = cur.execute("select name from sqlite_master where type = 'table'")

In [150]:
a.fetchall() # now ayushi1 table has gone

[('ayushi',), ('sarang1',)]

###### Difference between DROP & DELETE
###### DROP DELETE THE COMPLETE TABLE  WHILE DELETE JUST DELETE THE ROWS FROM TABLE

###### ALTER TABLE

##### The ALTER TABLE statement is used to add, delete, or modify columns in an existing table

The ALTER TABLE statement is also used to add and drop various constraints on an existing table.

####### Unlike SQL-standard and other database systems, SQLite supports a very limited functionality of the ALTER TABLE statement.

By using an SQLite ALTER TABLE statement, you can perform two actions:

Rename a table.
Add a new column to a table.
Rename a column (added supported in version 3.20.0)

In [4]:
cur.execute("CREATE TABLE bittu1(ID INTEGER auto_increment,name varchar,age integer)")

In [5]:
pd.read_sql_query("select * from bittu1",conn)

Empty DataFrame
Columns: [ID, name, age]
Index: []

###### ALTER TABLE ===> ADD

In [6]:
cur.execute("ALTER TABLE bittu1 ADD gender varchar")

In [12]:
pd.read_sql_query("select * from bittu1",conn)

Empty DataFrame
Columns: [ID, name, age, gender]
Index: []

###### ALTER TABLE =====> RENAME THE TABLE name

In [13]:
cur.execute("ALTER TABLE bittu1 RENAME TO PAGAL1")

In [15]:
cur.execute("select name from sqlite_master where type='table'")
cur.fetchall()

[('ayushi',), ('sarang1',), ('ayushi1',), ('PAGAL1',)]

###### ALTER TABLE ======>  RENAME COLUMN current_name TO new_name

In [16]:
cur.execute("ALTER TABLE PAGAL1 RENAME age TO AGE")

In [18]:
pd.read_sql_query("select * from PAGAL1",conn)

Empty DataFrame
Columns: [ID, name, AGE, gender]
Index: []

###### JOIN in SQL

Different Types of SQL JOINs
Here are the different types of the JOINs in SQL:

(INNER) JOIN: Returns records that have matching values in both tables
LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table
RIGHT (OUTER) JOIN: Returns all records from the right table, and the matched records from the left table
FULL (OUTER) JOIN: Returns all records when there is a match in either left or right tables

###### INNER JOIN

Suppose you have two tables: A and B.

A has a1, a2, and f columns. B has b1, b2, and f column.
The A table links to the B table using a foreign key column named f.

"""
SELECT a1, a2, b1, b2
FROM A
INNER JOIN B on B.f = A.f
"""

In [67]:
# First we will create the two separate table
cur.execute("create table if not exists gunnu3(nameid integer,name varchar,age integer,gender varchar)")
cur.execute("create table if not exists gunnu4(artistid integer,name varchar,experience varchar)")

In [68]:
cur.execute("insert into gunnu3 values(1,'sarang',22,'M')")
cur.execute("insert into gunnu3 values(2,'adarsh',22,'M')")
cur.execute("insert into gunnu3 values(3,'adarak',22,'M')")
cur.execute("insert into gunnu3 values(4,'kalyani',22,'M')")
cur.execute("insert into gunnu3 values(5,'mini',22,'M')")
conn.commit()

cur.execute("insert into gunnu4 values(2,'adarsh','2 years')")
cur.execute("insert into gunnu4 values(4,'babu','2 years')")
cur.execute("insert into gunnu4 values(5,'priyansh','2 years')")
cur.execute("insert into gunnu4 values(6,'love bhaiya','2 years')")
cur.execute("insert into gunnu4 values(7,'babu bhaiya','2 years')")
conn.commit()

In [70]:
print(pd.read_sql_query("select * from gunnu3",conn))
print(pd.read_sql_query("select * from gunnu4",conn))

   nameid     name  age gender
0       1   sarang   22      M
1       2   adarsh   22      M
2       3   adarak   22      M
3       4  kalyani   22      M
4       5     mini   22      M
   artistid         name experience
0         2       adarsh    2 years
1         4         babu    2 years
2         5     priyansh    2 years
3         6  love bhaiya    2 years
4         7  babu bhaiya    2 years

##### Innerjoin command

In [87]:
pd.read_sql_query("select nameid,age,experience,gunnu3.name,gunnu4.name from gunnu3 INNER JOIN gunnu4 ON gunnu3.name == gunnu4.name",conn)

   nameid  age experience    name    name
0       2   22    2 years  adarsh  adarsh

###### Left Join ------------here gunnu3 is left

In [93]:
pd.read_sql_query("select nameid,age,gunnu3.name from gunnu3 LEFT JOIN  gunnu4 ON gunnu3.name = gunnu4.name",conn)

   nameid  age     name
0       1   22   sarang
1       2   22   adarsh
2       3   22   adarak
3       4   22  kalyani
4       5   22     mini

###### Left Join ====> WHERE

In [96]:
pd.read_sql_query("select nameid,experience from gunnu3 LEFT JOIN  gunnu4 ON gunnu3.name = gunnu4.name where nameid = 2",conn)

   nameid experience
0       2    2 years

###### LEFT JOIN =====> ORDER BY

In [97]:
pd.read_sql_query("select nameid,experience from gunnu3 LEFT JOIN gunnu4 ON gunnu3.name = gunnu4.name ORDER BY nameid",conn)

   nameid experience
0       1       None
1       2    2 years
2       3       None
3       4       None
4       5       None

###### CROSS JOIN --- IT MEANS ALL POSSIBLE COMBINATION BETWEEN COMMON COLUMN

###### These 4 way to do cross join

SELECT *
FROM A JOIN B;

SELECT *
FROM A
INNER JOIN B;


SELECT *
FROM A
CROSS JOIN B;


SELECT * 
FROM A, B;

In [100]:
pd.read_sql_query("SELECT * FROM gunnu3,gunnu4",conn)

    nameid     name  age gender  artistid         name experience
0        1   sarang   22      M         2       adarsh    2 years
1        1   sarang   22      M         4         babu    2 years
2        1   sarang   22      M         5     priyansh    2 years
3        1   sarang   22      M         6  love bhaiya    2 years
4        1   sarang   22      M         7  babu bhaiya    2 years
5        2   adarsh   22      M         2       adarsh    2 years
6        2   adarsh   22      M         4         babu    2 years
7        2   adarsh   22      M         5     priyansh    2 years
8        2   adarsh   22      M         6  love bhaiya    2 years
9        2   adarsh   22      M         7  babu bhaiya    2 years
10       3   adarak   22      M         2       adarsh    2 years
11       3   adarak   22      M         4         babu    2 years
12       3   adarak   22      M         5     priyansh    2 years
13       3   adarak   22      M         6  love bhaiya    2 years
14       3   adarak   22      M         7  babu bhaiya    2 years
15       4  kalyani   22      M         2       adarsh    2 years
16       4  kalyani   22      M         4         babu    2 years
17       4  kalyani   22      M         5     priyansh    2 years
18       4  kalyani   22      M         6  love bhaiya    2 years
19       4  kalyani   22      M         7  babu bhaiya    2 years
20       5     mini   22      M         2       adarsh    2 years
21       5     mini   22      M         4         babu    2 years
22       5     mini   22      M         5     priyansh    2 years
23       5     mini   22      M         6  love bhaiya    2 years
24       5     mini   22      M         7  babu bhaiya    2 years

In [98]:
pd.read_sql_query("SELECT * FROM gunnu3 JOIN gunnu4",conn)

    nameid     name  age gender  artistid         name experience
0        1   sarang   22      M         2       adarsh    2 years
1        1   sarang   22      M         4         babu    2 years
2        1   sarang   22      M         5     priyansh    2 years
3        1   sarang   22      M         6  love bhaiya    2 years
4        1   sarang   22      M         7  babu bhaiya    2 years
5        2   adarsh   22      M         2       adarsh    2 years
6        2   adarsh   22      M         4         babu    2 years
7        2   adarsh   22      M         5     priyansh    2 years
8        2   adarsh   22      M         6  love bhaiya    2 years
9        2   adarsh   22      M         7  babu bhaiya    2 years
10       3   adarak   22      M         2       adarsh    2 years
11       3   adarak   22      M         4         babu    2 years
12       3   adarak   22      M         5     priyansh    2 years
13       3   adarak   22      M         6  love bhaiya    2 years
14       3   adarak   22      M         7  babu bhaiya    2 years
15       4  kalyani   22      M         2       adarsh    2 years
16       4  kalyani   22      M         4         babu    2 years
17       4  kalyani   22      M         5     priyansh    2 years
18       4  kalyani   22      M         6  love bhaiya    2 years
19       4  kalyani   22      M         7  babu bhaiya    2 years
20       5     mini   22      M         2       adarsh    2 years
21       5     mini   22      M         4         babu    2 years
22       5     mini   22      M         5     priyansh    2 years
23       5     mini   22      M         6  love bhaiya    2 years
24       5     mini   22      M         7  babu bhaiya    2 years

In [99]:
pd.read_sql_query("SELECT * FROM gunnu3 INNER JOIN gunnu4",conn)

    nameid     name  age gender  artistid         name experience
0        1   sarang   22      M         2       adarsh    2 years
1        1   sarang   22      M         4         babu    2 years
2        1   sarang   22      M         5     priyansh    2 years
3        1   sarang   22      M         6  love bhaiya    2 years
4        1   sarang   22      M         7  babu bhaiya    2 years
5        2   adarsh   22      M         2       adarsh    2 years
6        2   adarsh   22      M         4         babu    2 years
7        2   adarsh   22      M         5     priyansh    2 years
8        2   adarsh   22      M         6  love bhaiya    2 years
9        2   adarsh   22      M         7  babu bhaiya    2 years
10       3   adarak   22      M         2       adarsh    2 years
11       3   adarak   22      M         4         babu    2 years
12       3   adarak   22      M         5     priyansh    2 years
13       3   adarak   22      M         6  love bhaiya    2 years
14       3   adarak   22      M         7  babu bhaiya    2 years
15       4  kalyani   22      M         2       adarsh    2 years
16       4  kalyani   22      M         4         babu    2 years
17       4  kalyani   22      M         5     priyansh    2 years
18       4  kalyani   22      M         6  love bhaiya    2 years
19       4  kalyani   22      M         7  babu bhaiya    2 years
20       5     mini   22      M         2       adarsh    2 years
21       5     mini   22      M         4         babu    2 years
22       5     mini   22      M         5     priyansh    2 years
23       5     mini   22      M         6  love bhaiya    2 years
24       5     mini   22      M         7  babu bhaiya    2 years

In [101]:
pd.read_sql_query("SELECT * from gunnu3 CROSS JOIN gunnu4",conn)

    nameid     name  age gender  artistid         name experience
0        1   sarang   22      M         2       adarsh    2 years
1        1   sarang   22      M         4         babu    2 years
2        1   sarang   22      M         5     priyansh    2 years
3        1   sarang   22      M         6  love bhaiya    2 years
4        1   sarang   22      M         7  babu bhaiya    2 years
5        2   adarsh   22      M         2       adarsh    2 years
6        2   adarsh   22      M         4         babu    2 years
7        2   adarsh   22      M         5     priyansh    2 years
8        2   adarsh   22      M         6  love bhaiya    2 years
9        2   adarsh   22      M         7  babu bhaiya    2 years
10       3   adarak   22      M         2       adarsh    2 years
11       3   adarak   22      M         4         babu    2 years
12       3   adarak   22      M         5     priyansh    2 years
13       3   adarak   22      M         6  love bhaiya    2 years
14       3   adarak   22      M         7  babu bhaiya    2 years
15       4  kalyani   22      M         2       adarsh    2 years
16       4  kalyani   22      M         4         babu    2 years
17       4  kalyani   22      M         5     priyansh    2 years
18       4  kalyani   22      M         6  love bhaiya    2 years
19       4  kalyani   22      M         7  babu bhaiya    2 years
20       5     mini   22      M         2       adarsh    2 years
21       5     mini   22      M         4         babu    2 years
22       5     mini   22      M         5     priyansh    2 years
23       5     mini   22      M         6  love bhaiya    2 years
24       5     mini   22      M         7  babu bhaiya    2 years

###### ORDER BY

The ORDER BY clause comes after the FROM clause. It allows you to sort the result set based on one or more columns in ascending or descending order.

In this syntax, you place the column name by which you want to sort after the ORDER BY clause followed by the ASC or DESC keyword.

In [107]:
pd.read_sql_query("select * from gunnu3 order by nameid desc",conn)

   nameid     name  age gender
0       5     mini   22      M
1       4  kalyani   22      M
2       3   adarak   22      M
3       2   adarsh   22      M
4       1   sarang   22      M

###### Group by ======> COUNT,MIN,MAX,SUM,AVG

The GROUP BY clause returns one row for each group. For each group, you can apply an aggregate function such as MIN, MAX, SUM, COUNT, or AVG to provide more information about each group.

SELECT 
    column_1,
    aggregate_function(column_2) 
FROM 
    table
GROUP BY 
    column_1,
    column_2;
    
IMP====>>>>>  The GROUP BY clause comes after the FROM clause of the SELECT statement. In case a statement contains a WHERE clause, the GROUP BY clause must come after the WHERE clause.

In [113]:
print(pd.read_sql_query("select name,count(age) from gunnu3 group by name",conn))
print(pd.read_sql_query("select name,min(age) from gunnu3 group by name",conn))
print(pd.read_sql_query("select name,max(age) from gunnu3 group by name",conn))
print(pd.read_sql_query("select name,sum(age) from gunnu3 group by name",conn))
print(pd.read_sql_query("select name,avg(age) from gunnu3 group by name",conn))

      name  count(age)
0   adarak           1
1   adarsh           1
2  kalyani           1
3     mini           1
4   sarang           1
      name  min(age)
0   adarak        22
1   adarsh        22
2  kalyani        22
3     mini        22
4   sarang        22
      name  max(age)
0   adarak        22
1   adarsh        22
2  kalyani        22
3     mini        22
4   sarang        22
      name  sum(age)
0   adarak        22
1   adarsh        22
2  kalyani        22
3     mini        22
4   sarang        22
      name  avg(age)
0   adarak      22.0
1   adarsh      22.0
2  kalyani      22.0
3     mini      22.0
4   sarang      22.0